version 1.4 - refreshed frontend and manual switching of modes implemented and retry ,cancel implemented
